/***********************************************************************************
	*文件名：delay.c
	*作者：商俊辉
	*版本号：v1.0
	*日期：2021.11.14
	*描述：STM32F103延时函数
	*备注：最小系统
	*历史记录：
	*
***********************************************************************************/  
#include "./Delay/delay.h"


/****************************
函数名称：Delay_nop_1us
函数作用：延时1微妙
函数参数：无
函数返回值：无
函数作者：XYD_WYC
创建时间：2020.08.11
修改时间：2020.08.11
****************************/
void Delay_nop_1us(void)
{
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();__nop();
	__nop();__nop();
}

/****************************
函数名称：Delay_us
函数作用：延时n微妙
函数参数：time 	延时时间
函数返回值：无
函数作者：XYD_WYC
创建时间：2020.08.11
修改时间：2020.08.11
****************************/
void Delay_us(uint32_t time)
{
	while(time--)
		Delay_nop_1us();
}


void Delay_ms(uint32_t time)
{
	while(time--)
		Delay_us(1000);
}


